Curso_CFD_2018/cylinder2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
  top
    {
      //           type            symmetryPlane; 
      type          slip;
	   //       type            fixedValue;
	   //value           uniform (1 0 0);
    }

  left
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

  right
    {
        type            zeroGradient;
    }

  
  bottom
    {
      //                 type            symmetryPlane; 
      type            slip;
    }

    cylinder
    {    
      type      noSlip;
    }

  
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //





  // left
  //   {
  //       type            zeroGradient;
  //   }

  // right
  //   {
  //       type            zeroGradient;
  //   }


//The inletOutlet boundary condition is
//normally the same as zeroGradient, but it
//switches to fixedValue if the velocity vector
//next to the boundary aims inside the domain (backward flow).
//The value of that fixedValue is inletValue. See figure ([*]).


    // outlet
    // {
    //     type            inletOutlet;
    //     inletValue      uniform (0 0 0);
    //     value           $internalField;
    // }

